app/helpers/sessions_helper.rb

UPDATE "users" SET "updated_at" = ?, "remember_token" = ? WHERE "users"."id" = ?  [["updated_at", "2020-01-20 19:00:03.196662"], ["remember_token", "0a6bc29adfcc9788cf669d04e8687e876cbc9aea"], ["id", 7]]
---
  def sign_in(user)
    session[:user_id] = user.id
    remember_token = User.new_token
    cookies.permanent[:remember_token] = remember_token
    user.update_attribute(:remember_token, User.digest(remember_token))