app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% if logged_in? %>
    <%= User.find_by(id: p.user_id).name  %>