app/controllers/application_controller.rb

  def sign_in(user)
    session[:user_id] = user.id
    remember_token = User.new_token
    cookies.permanent[:remember_token] = remember_token
    user.update_attribute(:remember_token, User.digest(remember_token))
---
UPDATE "users" SET "updated_at" = ?, "remember_token" = ? WHERE "users"."id" = ?  [["updated_at", "2020-01-21 15:11:35.017350"], ["remember_token", "cdc9f99306066bcc51d3d09ba50994563e273d74"], ["id", 9]]