app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "dasdaewqrqw"], ["user_id", 2], ["created_at", "2020-01-20 23:21:13.414694"], ["updated_at", "2020-01-20 23:21:13.414694"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    @post.save