app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name", "email", "password_digest", "remember_token") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create(user_params)